export const sampleBoards = [
  [
    [
      { title: "글1", comment_num: 100 },
      { title: "글2", comment_num: 100 },
      { title: "글3", comment_num: 100 },
    ],
    3,
  ],
  [
    [
      { title: "글1", comment_num: 100 },
      { title: "글2", comment_num: 100 },
    ],
    2,
  ],
  [
    [
      { title: "글1", comment_num: 100 },
      { title: "글2", comment_num: 100 },
    ],
    2,
  ],
  [
    [
      { title: "글1", comment_num: 100 },
      { title: "글2", comment_num: 100 },
    ],
    2,
  ],
  [
    [
      { title: "글1", comment_num: 100 },
      { title: "글2", comment_num: 100 },
    ],
    2,
  ],
  [
    [
      { title: "글4", comment_num: 100 },
      { title: "글5", comment_num: 100 },
    ],
    2,
  ],
  [
    [
      { title: "글5", comment_num: 100 },
      { title: "글6", comment_num: 100 },
    ],
    2,
  ],
  [
    [
      { title: "글5", comment_num: 100 },
      { title: "글6", comment_num: 100 },
    ],
    2,
  ],
];

export const samplePosts = [
  {
    id: "1",
    title: "게시물1",
    c_min: 18,
    n_view: 100,
    n_like: 90,
  },

  {
    id: "2",
    title: "게시물2",
    c_min: 18,
    n_view: 100,
    n_like: 90,
  },
  {
    id: "3",
    title: "게시물3",
    c_min: 18,
    n_view: 100,
    n_like: 90,
  },
  {
    id: "4",
    title: "게시물4",
    c_min: 18,
    n_view: 100,
    n_like: 90,
  },
  {
    id: "5",
    title: "게시물5",
    c_min: 18,
    n_view: 100,
    n_like: 90,
  },
];

export const samplePost = {
  posts: 1,
  writer: "박홍진",
  time: "2023-01-10 12:12",
  title: "올해 강의 새로나왔는데 같이 들을 분 계신가요?",
  content: `제곧내입니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.`,
  nRead: 82,
  likes: 80,
  comment: 3,
  comments: [
    {
      commenter: "김민석",
      commentcontent: `구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
      어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
      어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
      어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
      어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
      어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
     `,
    },
    {
      commenter: "김은경",
      commentcontent: "저 들을까요",
    },
    {
      commenter: "박홍진",
      commentcontent: "ㅋ",
    },
  ],
};

export const PostsList = ["1", "2", "3", "4", "5", "6"];
