export const sampleBoards = [
  {
    index: 0,
    name: "자유게시판",
    total_num: 123,
    posts: [
      {
        id: 0,
        title: "자유 post1",
        comment_num: 3,
        click_num: 100,
        writer: "손채환",
        m_date: 1,
        d_date: 3,
      },
      {
        id: 1,
        title: "자유 post2",
        comment_num: 3,
        click_num: 100,
        writer: "손채환",
        m_date: 1,
        d_date: 3,
      },
      {
        id: 2,
        title: "자유 post3",
        comment_num: 3,
        click_num: 100,
        writer: "손채환",
        m_date: 1,
        d_date: 3,
      },
      {
        id: 3,
        title: "자유 post4",
        comment_num: 3,
        click_num: 100,
        writer: "손채환",
        m_date: 1,
        d_date: 3,
      },
    ],
  },
  {
    index: 1,
    name: "CPA 게시판",
    total_num: 123,
    posts: [
      {
        id: 4,
        title: "CPA post1",
        comment_num: 3,
        click_num: 100,
        writer: "손채환",
        m_date: 1,
        d_date: 3,
      },
      {
        id: 5,
        title: "CPA post2",
        comment_num: 3,
        click_num: 100,
        writer: "손채환",
        m_date: 1,
        d_date: 3,
      },
      {
        id: 6,
        title: "CPA post3",
        comment_num: 3,
        click_num: 100,
        writer: "손채환",
        m_date: 1,
        d_date: 3,
      },
      {
        id: 7,
        title: "CPA post4",
        comment_num: 3,
        click_num: 100,
        writer: "손채환",
        m_date: 1,
        d_date: 3,
      },
    ],
  },
  {
    index: 2,
    name: "LEET 게시판",
    total_num: 123,
    posts: [
      {
        id: 8,
        title: "LEET post1",
        comment_num: 3,
        click_num: 100,
        writer: "손채환",
        m_date: 1,
        d_date: 3,
      },
      {
        id: 9,
        title: "LEET post2",
        comment_num: 3,
        click_num: 100,
        writer: "손채환",
        m_date: 1,
        d_date: 3,
      },
    ],
  },
  {
    index: 0,
    name: "자유게시판",
    total_num: 123,
    posts: [
      {
        id: 0,
        title: "자유 post1",
        comment_num: 3,
        click_num: 100,
        writer: "손채환",
        m_date: 1,
        d_date: 3,
      },
      {
        id: 1,
        title: "자유 post2",
        comment_num: 3,
        click_num: 100,
        writer: "손채환",
        m_date: 1,
        d_date: 3,
      },
      {
        id: 2,
        title: "자유 post3",
        comment_num: 3,
        click_num: 100,
        writer: "손채환",
        m_date: 1,
        d_date: 3,
      },
      {
        id: 3,
        title: "자유 post4",
        comment_num: 3,
        click_num: 100,
        writer: "손채환",
        m_date: 1,
        d_date: 3,
      },
    ],
  },
];

export const sampleBlogs = [
  {
    id: "1e123123123",
    name: "게시물1",
    info: "18분전|조회100|좋아요90",
  },
  {
    id: "1e123123123",
    name: "게시물1",
    info: "18분전|조회100|좋아요90",
  },
  {
    id: "1e123123123",
    name: "게시물1",
    info: "18분전|조회100|좋아요90",
  },
  {
    id: "1e123123123",
    name: "게시물1",
    info: "18분전|조회100|좋아요90",
  },
  {
    id: "1e123123123",
    name: "게시물1",
    info: "18분전|조회100|좋아요90",
  },
  {
    id: "1e123123123",
    name: "게시물1",
    info: "18분전|조회100|좋아요90",
  },
  {
    id: "1e123123123",
    name: "게시물1",
    info: "18분전|조회100|좋아요90",
  },
  {
    id: "1e123123123",
    name: "게시물1",
    info: "18분전|조회100|좋아요90",
  },
  {
    id: "1e123123123",
    name: "게시물1",
    info: "18분전|조회100|좋아요90",
  },
  {
    id: "1e123123123",
    name: "게시물1",
    info: "18분전|조회100|좋아요90",
  },
  {
    id: "1e123123123",
    name: "게시물1",
    info: "18분전|조회100|좋아요90",
  },
  {
    id: "1e123123123",
    name: "게시물1",
    info: "18분전|조회100|좋아요90",
  },
  {
    id: "1e123123123",
    name: "게시물1",
    info: "18분전|조회100|좋아요90",
  },
  {
    id: "1e123123123",
    name: "게시물1",
    info: "18분전|조회100|좋아요90",
  },
  {
    id: "1e123123123",
    name: "게시물1",
    info: "18분전|조회100|좋아요90",
  },
  {
    id: "1e123123123",
    name: "게시물1",
    info: "18분전|조회100|좋아요90",
  },
  {
    id: "1e123123123",
    name: "게시물1",
    info: "18분전|조회100|좋아요90",
  },
];

export const BlogSampleData = {
  blogs: 1,
  writer: "박홍진",
  time: "2023-01-10 12:12",
  title: "올해 강의 새로나왔는데 같이 들을 분 계신가요?",
  content: `제곧내입니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  ㅍ
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
  어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.`,

  nRead: 82,
  likes: 80,
  comment: 3,
  comments: [
    {
      commenter: "김민석",
      commentcontent: `구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
      어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
      어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
      어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
      어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
      어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
      어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
      어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
      어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
      어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
      어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
      어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용을 채우고 있습니다.
      어쩌구 저쩌구해서 어쩌구 저쩌구 본문 내용`,
    },
    {
      commenter: "김은경",
      commentcontent: "저 들을까요",
    },
    {
      commenter: "박홍진",
      commentcontent: "ㅋ",
    },
  ],
};

export const BlogsList = [
  "게시판1",
  "게시판2",
  "게시판3",
  "게시판4",
  "게시판5",
  "게시판6",
];
